In [40]:
import pandas as pd
import numpy as np
from datetime import datetime

In [41]:
sales_dict = {
'ord-no': np.random.randint(5000, 5100, 12),
'purchase_amt': np.random.uniform(500, 1500, 12).round(2),
'customer_id': np.random.randint(3000, 3008, 12),
'salesman_id': np.random.randint(5000, 5005, 12)
}

In [42]:
sales_dict

{'ord-no': array([5037, 5046, 5092, 5088, 5081, 5074, 5050, 5014, 5026, 5022, 5083,
        5055]),
 'purchase_amt': array([1004.35, 1389.57,  693.11, 1257.08,  596.53, 1139.07,  998.65,
        1092.21,  786.01, 1450.82,  687.43,  794.84]),
 'customer_id': array([3001, 3000, 3003, 3004, 3007, 3007, 3005, 3002, 3001, 3002, 3006,
        3003]),
 'salesman_id': array([5004, 5004, 5004, 5000, 5002, 5001, 5003, 5002, 5002, 5001, 5004,
        5004])}

In [43]:
sales_df = pd.DataFrame(sales_dict)
sales_df

,ord-no,purchase_amt,customer_id,salesman_id
0,5037,1004.35,3001,5004
1,5046,1389.57,3000,5004
2,5092,693.11,3003,5004
3,5088,1257.08,3004,5000
4,5081,596.53,3007,5002
5,5074,1139.07,3007,5001
6,5050,998.65,3005,5003
7,5014,1092.21,3002,5002
8,5026,786.01,3001,5002
9,5022,1450.82,3002,5001
10,5083,687.43,3006,5004
11,5055,794.84,3003,5004

7. **Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).**

In [44]:
grouped_df = sales_df.groupby(['customer_id'], as_index=False)
grouped_df.agg(Mean_Purchas_Amt=('purchase_amt', np.mean), Min_Purchase_Amt=('purchase_amt', np.min), 
Max_Pruchase_Amt=('purchase_amt', np.max))

,customer_id,Mean_Purchas_Amt,Min_Purchase_Amt,Max_Pruchase_Amt
0,3000,1389.570,1389.57,1389.57
1,3001,895.180,786.01,1004.35
2,3002,1271.515,1092.21,1450.82
3,3003,743.975,693.11,794.84
4,3004,1257.080,1257.08,1257.08
5,3005,998.650,998.65,998.65
6,3006,687.430,687.43,687.43
7,3007,867.800,596.53,1139.07

**8. Write a Pandas program to split a dataset to group by two columns and count by each row.**

In [45]:
sales_df.groupby(['customer_id','salesman_id'], as_index=False).count()

,customer_id,salesman_id,ord-no,purchase_amt
0,3000,5004,1,1
1,3001,5002,1,1
2,3001,5004,1,1
3,3002,5001,1,1
4,3002,5002,1,1
5,3003,5004,2,2
6,3004,5000,1,1
7,3005,5003,1,1
8,3006,5004,1,1
9,3007,5001,1,1
10,3007,5002,1,1

In [46]:
sales_df.groupby(['salesman_id','customer_id']).size().reset_index()

,salesman_id,customer_id,0
0,5000,3004,1
1,5001,3002,1
2,5001,3007,1
3,5002,3001,1
4,5002,3002,1
5,5002,3007,1
6,5003,3005,1
7,5004,3000,1
8,5004,3001,1
9,5004,3003,2
10,5004,3006,1

**9. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups. Go to the editor
In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.**

In [47]:
grouped_df = sales_df.groupby(['customer_id', 'salesman_id'], as_index=False)
sorted_df= grouped_df.sum('purchase_amt').sort_values('purchase_amt', ascending=True)
new_df = sorted_df[['customer_id', 'salesman_id', 'purchase_amt']]
new_df

,customer_id,salesman_id,purchase_amt
10,3007,5002,596.53
8,3006,5004,687.43
1,3001,5002,786.01
7,3005,5003,998.65
2,3001,5004,1004.35
4,3002,5002,1092.21
9,3007,5001,1139.07
6,3004,5000,1257.08
0,3000,5004,1389.57
3,3002,5001,1450.82
5,3003,5004,1487.95

**10. Write a Pandas program to split the following dataframe into groups based on customer id and create a list of order date for each group**

https://stackoverflow.com/questions/50559078/generating-random-dates-within-a-given-range-in-pandas

In [51]:
def random_dates(start, end, n=12):

    start_u = start.value//10**9
    end_u = end.value//10**9

    rand_dates = list(pd.to_datetime(np.random.randint(start_u, end_u, n), unit='s'))    
    sales_df['ord_dates']=rand_dates
    print(sales_df)


start = pd.to_datetime('2017-01-01')
end = pd.to_datetime('2018-01-01')
random_dates(start, end)

    ord-no  purchase_amt  customer_id  salesman_id           ord_dates
0     5037       1004.35         3001         5004 2017-05-18 09:51:39
1     5046       1389.57         3000         5004 2017-12-06 23:11:11
2     5092        693.11         3003         5004 2017-11-08 17:15:18
3     5088       1257.08         3004         5000 2017-06-01 00:13:17
4     5081        596.53         3007         5002 2017-06-23 11:51:05
5     5074       1139.07         3007         5001 2017-04-04 10:57:18
6     5050        998.65         3005         5003 2017-03-30 00:44:50
7     5014       1092.21         3002         5002 2017-09-22 06:36:21
8     5026        786.01         3001         5002 2017-11-15 09:05:25
9     5022       1450.82         3002         5001 2017-04-08 03:40:48
10    5083        687.43         3006         5004 2017-06-27 11:07:40
11    5055        794.84         3003         5004 2017-01-08 14:51:51

In [55]:
grouped_data = sales_df.groupby(['customer_id'], as_index=False)
grouped_data['ord_dates'].count()

,customer_id,ord_dates
0,3000,1
1,3001,2
2,3002,2
3,3003,2
4,3004,1
5,3005,1
6,3006,1
7,3007,2